[
    {
        "quote": "Never argue with stupid people, they will drag you down to their level and then beat you with experience.",
        "author": "Mark Twain"
    },
    {
        "quote": "Get your facts first, then you can distort them as you please.",
        "author": "Mark Twain"
    },
    {
        "quote": "If you tell the truth, you don't have to remember anything.",
        "author": "Mark Twain"
    },
    {
        "quote": "A lie can travel halfway around the world while the truth is putting on its shoes.",
        "author": "Mark Twain"
    },
    {
        "quote": "I have never let my schooling interfere with my education.",
        "author": "Mark Twain"
    },
    {
        "quote": "I can resist everything except temptation.",
        "author": "Oscar Wilde"
    },
    {
        "quote": "We are all in the gutter, but some of us are looking at the stars.",
        "author": "Oscar Wilde"
    },
    {
        "quote": "I am so clever that sometimes I don't understand a single word of what I am saying.",
        "author": "Oscar Wilde"
    },
    {
        "quote": "The only way to get rid of temptation is to yield to it.",
        "author": "Oscar Wilde"
    },
    {
        "quote": "Always forgive your enemies - nothing annoys them so much.",
        "author": "Oscar Wilde"
    },
    {
        "quote": "Life isn't about finding yourself. Life is about creating yourself.",
        "author": "George Bernard Shaw"
    },
    {
        "quote": "We don't stop playing because we grow old; we grow old because we stop playing.",
        "author": "George Bernard Shaw"
    },
    {
        "quote": "Those who cannot change their minds cannot change anything.",
        "author": "George Bernard Shaw"
    },
    {
        "quote": "A life spent making mistakes is not only more honorable, but more useful than a life spent doing nothing.",
        "author": "George Bernard Shaw"
    },
    {
        "quote": "The reasonable man adapts himself to the world: the unreasonable one persists in trying to adapt the world to himself. Therefore all progress depends on the unreasonable man.",
        "author": "George Bernard Shaw"
    },
    {
        "quote": "For every complex problem there is an answer that is clear, simple, and wrong.",
        "author": "H.L. Mencken"
    },
    {
        "quote": "The whole aim of practical politics is to keep the populace alarmed (and hence clamorous to be led to safety) by menacing it with an endless series of hobgoblins, all of them imaginary.",
        "author": "H.L. Mencken"
    },
    {
        "quote": "The one permanent emotion of the inferior man is fear - fear of the unknown, the complex, the inexplicable. What he wants above everything else is safety.",
        "author": "H.L. Mencken"
    },
    {
        "quote": "The average man does not want to be free. He simply wants to be safe.",
        "author": "H.L. Mencken"
    },
    {
        "quote": "Moral certainty is always a sign of cultural inferiority. The more uncivilized the man, the surer he is that he knows precisely what is right and what is wrong.",
        "author": "H.L. Mencken"
    },
    {
        "quote": "I'm not afraid of death; I just don't want to be there when it happens.",
        "author": "Woody Allen"
    },
    {
        "quote": "A day without laughter is a day wasted.",
        "author": "Charlie Chaplin"
    },
    {
        "quote": "Behind every great man is a woman rolling her eyes.",
        "author": "Jim Carrey"
    },
    {
        "quote": "I can resist everything except temptation.",
        "author": "Oscar Wilde"
    },
    {
        "quote": "I used to jog but the ice cubes kept falling out of my glass.",
        "author": "David Lee Roth"
    },
    {
        "quote": "I'm an idealist. I don't know where I'm going, but I'm on my way.",
        "author": "Carl Sandburg"
    },
    {
        "quote": "My therapist told me the way to achieve true inner peace is to finish what I start. So far I’ve finished two bags of M&Ms and a chocolate cake. I feel better already.",
        "author": "Dave Barry"
    },
    {
        "quote": "When we talk to God, we're praying. When God talks to us, we're schizophrenic.",
        "author": "Jane Wagner"
    },
    {
        "quote": "If you think you are too small to make a difference, try sleeping with a mosquito.",
        "author": "Dalai Lama"
    },
    {
        "quote": "My doctor told me to watch my drinking. Now I drink in front of a mirror.",
        "author": "Rodney Dangerfield"
    },
    {
        "quote": "I love deadlines. I like the whooshing sound they make as they fly by.",
        "author": "Douglas Adams"
    },
    {
        "quote": "If I were two-faced, would I be wearing this one?",
        "author": "Abraham Lincoln"
    },
    {
        "quote": "I'm not superstitious, but I am a little stitious.",
        "author": "Steve Carell"
    },
    {
        "quote": "A clear conscience is a sure sign of a bad memory.",
        "author": "Mark Twain"
    },
    {
        "quote": "I refuse to answer that question on the grounds that I don't know the answer.",
        "author": "Douglas Adams"
    },
    {
        "quote": "You can't have everything. Where would you put it?",
        "author": "Steven Wright"
    },
    {
        "quote": "I've had a perfectly wonderful evening, but this wasn't it.",
        "author": "Groucho Marx"
    },
    {
        "quote": "Age is something that doesn't matter, unless you are a cheese.",
        "author": "Luis Buñuel"
    },
    {
        "quote": "Some people never go crazy. What truly horrible lives they must lead.",
        "author": "Charles Bukowski"
    },
    {
        "quote": "Why do they call it rush hour when nothing moves?",
        "author": "Robin Williams"
    }
]