[
    {
        "author": "Sigmund Freud",
        "quote": "The mind is like an iceberg, it floats with one-seventh of its bulk above water."
    },
    {
        "author": "William James",
        "quote": "The greatest discovery of my generation is that human beings can alter their lives by altering their attitudes of mind."
    },
    {
        "author": "Bertrand Russell",
        "quote": "Man needs, for his happiness, not only the enjoyment of this or that, but hope and enterprise and change."
    },
    {
        "author": "Paul Valery",
        "quote": "The purpose of psychology is to give us a completely different idea of the things we know best."
    },
    {
        "author": "Ellen Langer",
        "quote": "It is not primarily our physical selves that limit us but rather our mindset about our physical limits."
    },
    {
        "author": "Sigmund Freud",
        "quote": "We are never so defenseless against suffering as when we love."
    },
    {
        "author": "William Shakespeare",
        "quote": "We know what we are but not what we may be."
    },
    {
        "author": "Charles Darwin",
        "quote": "It is not the strongest of the species that survives, nor the most intelligent, but the one most responsive to change."
    },
    {
        "author": "Gordon Allport",
        "quote": "Remember, you're as good as the best, but no better than the rest."
    },
    {
        "author": "Daniel Goleman",
        "quote": "In a very real sense we have two minds, one that thinks and one that feels."
    },
    {
        "author": "Carl Jung",
        "quote": "Until you make the unconscious conscious, it will direct your life and you will call it fate."
    },
    {
        "author": "B.F. Skinner",
        "quote": "The real problem is not whether machines think but whether men do."
    },
    {
        "author": "Jean Piaget",
        "quote": "The goal of education is not to increase the amount of knowledge but to create the possibilities for a child to invent and discover."
    },
    {
        "author": "Abraham Maslow",
        "quote": "What is necessary to change a person is to change his awareness of himself."
    },
    {
        "author": "Albert Bandura",
        "quote": "Most of the images of reality on which we base our actions are really based on vicarious experience."
    },
    {
        "author": "Ivan Pavlov",
        "quote": "If you want new ideas, read old books."
    },
    {
        "author": "John Watson",
        "quote": "Give me a dozen healthy infants, well-formed, and my own specified world to bring them up in and I'll guarantee to take any one at random and train him to become any type of specialist I might select."
    },
    {
        "author": "Martin Seligman",
        "quote": "The good life is a process, not a state of being. It is a direction not a destination."
    },
    {
        "author": "Carl Rogers",
        "quote": "The only person who is educated is the one who has learned how to learn and change."
    },
    {
        "author": "Erik Erikson",
        "quote": "Life doesn't make any sense without interdependence. We need each other, and the sooner we learn that, the better for us all."
    },
    {
        "author": "Sigmund Freud",
        "quote": "Dreams are the royal road to the unconscious."
    },
    {
        "author": "Alfred Adler",
        "quote": "It is easier to fight for one's principles than to live up to them."
    },
    {
        "author": "Jacques Lacan",
        "quote": "What does it matter how many lovers you have if none of them gives you the universe?"
    },
    {
        "author": "Karen Horney",
        "quote": "Fortunately analysis is not the only way to resolve inner conflicts. Life itself still remains a very effective therapist."
    },
    {
        "author": "Rollo May",
        "quote": "The opposite of courage in our society is not cowardice, it is conformity."
    },
    {
        "author": "Carl Jung",
        "quote": "The shoe that fits one person pinches another; there is no recipe for living that suits all cases."
    },
    {
        "author": "Wilhelm Wundt",
        "quote": "The task of psychology is to give us knowledge of the inner life of man."
    },
    {
        "author": "Stanley Milgram",
        "quote": "Ordinary people, simply doing their jobs, and without any particular hostility on their part, can become agents in a terrible destructive process."
    },
    {
        "author": "Melanie Klein",
        "quote": "One of the many interesting and surprising experiences of the beginner in child analysis is to find in even very young children a capacity for insight which is often far greater than that of adults."
    },
    {
        "author": "Donald O. Hebb",
        "quote": "If it isn't rewarded, it isn't learned."
    },
    {
        "author": "Francine Shapiro",
        "quote": "When a disturbing event happens, it can get locked in the brain with the original picture, sounds, thoughts, feelings, and body sensations."
    },
    {
        "author": "John Bowlby",
        "quote": "What cannot be communicated to the [m]other cannot be communicated to the self."
    },
    {
        "author": "Leon Festinger",
        "quote": "A man with a conviction is a hard man to change."
    },
    {
        "author": "Elizabeth Loftus",
        "quote": "Just because someone tells you something doesn't mean it's true. Our memories can be influenced by many things, including our beliefs and expectations."
    },
    {
        "author": "Abraham Maslow",
        "quote": "In any given moment we have two options: to step forward into growth or to step back into safety."
    },
    {
        "author": "Philip Zimbardo",
        "quote": "Stress is the trash of modern life-we all generate it but if you don't dispose of it properly, it will pile up and overtake your life."
    },
    {
        "author": "Oliver Sacks",
        "quote": "Every act of perception, is to some degree an act of creation, and every act of memory is to some degree an act of imagination."
    },
    {
        "author": "Irvin D. Yalom",
        "quote": "Some day soon, perhaps in forty years, there will be no one alive who has ever known me. That's when I will be truly dead - when I exist in no one's memory."
    },
    {
        "author": "Elisabeth Kubler-Ross",
        "quote": "The most beautiful people we have known are those who have known defeat, known suffering, known struggle, known loss, and have found their way out of the depths."
    },
    {
        "author": "Albert Ellis",
        "quote": "The best years of your life are the ones in which you decide your problems are your own. You do not blame them on your mother, the ecology, or the president. You realize that you control your own destiny."
    },
    {
        "author": "Aaron T. Beck",
        "quote": "If you have made mistakes, even serious ones, there is always another chance for you. What we call failure is not the falling down but the staying down."
    },
    {
        "author": "Howard Gardner",
        "quote": "I want my children to understand the world, but not just because the world is fascinating and the human mind is curious. I want them to understand it so that they will be positioned to make it a better place."
    },
    {
        "author": "Mary Ainsworth",
        "quote": "Security doesn't come from what you can hold in your hands; it comes from what you can stand to lose."
    },
    {
        "author": "Carl Rogers",
        "quote": "The good life is a process, not a state of being. It is a direction not a destination."
    },
    {
        "author": "Steven Pinker",
        "quote": "The mind is a complex system of cognitive adaptations designed by natural selection to solve the problems faced by our evolutionary ancestors."
    },
    {
        "author": "Daniel Kahneman",
        "quote": "Nothing in life is as important as you think it is, while you are thinking about it."
    },
    {
        "author": "David D. Burns",
        "quote": "Depression can seem worse than terminal cancer, because most cancer patients feel loved and they have hope and self-esteem."
    },
    {
        "author": "Jiddu Krishnamurti",
        "quote": "It is no measure of health to be well adjusted to a profoundly sick society."
    },
    {
        "author": "Steven Hayes",
        "quote": "If you aren't willing to have it, you will: If you're willing to have it, you won't."
    },
    {
        "author": "Marsha Linehan",
        "quote": "People with BPD are like people with third degree burns over 90% of their bodies. Lacking emotional skin, they feel agony at the slightest touch or movement."
    }
]